---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CannotCreateGeometryForPipe
source: html/3d587a64-ba7b-4b9c-a9dd-cc96a871efa9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.CannotCreateGeometryForPipe Property

Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGeometryForPipe { get; }
```